index.org
#+TITLE: Evaluating navigational RDF queries over the Web
#+DATE: <2013-06-04 Tue>
#+AUTHOR: Your name
#+EMAIL: Your email address
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not LOGBOOK) date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+CREATOR: Emacs 24.3.50.3 (Org mode 8.0.3)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export


#+OPTIONS: html-postamble:auto html-preamble:t tex:t
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.3 (<a href="http://orgmode.org">Org</a> mode 8.0.3)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD: <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/0.6.0/pure-min.css">
#+HTML_HEAD_EXTRA:
#+HTML_HTML5_FANCY:
#+HTML_INCLUDE_SCRIPTS:
#+HTML_INCLUDE_STYLE:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:


* Introduction
This is better than uninformed search.

* Results
** Selected queries
*** Q10  Publications                                      :dbpedia:selected:
 #+begin_src sparql
 prefix dc:         <http://purl.org/dc/elements/1.1/>
 prefix dblpAuthor: <http://dblp.l3s.de/d2r/resource/authors/>

 select * where {
	 dblpAuthor:Michael_Stonebraker  ^dc:creator/dc:title  ?paper
 }
 #+end_src


*** Q11  Journals                                          :dbpedia:selected:
 #+begin_src sparql
 prefix dc:         <http://purl.org/dc/elements/1.1/>
 prefix dblpAuthor: <http://dblp.l3s.de/d2r/resource/authors/>
 prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>
 prefix swrc:    <http://swrc.ontoware.org/ontology#>

 select * where {
	 dblpAuthor:Michael_Stonebraker  ^dc:creator/swrc:journal/rdfs:label  ?paper
 }
 #+end_src


