index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-07 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Evaluating navigational RDF queries over the Web</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Your name" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/0.6.0/pure-min.css">
</head>
<body>
<div id="content">
<h1 class="title">Evaluating navigational RDF queries over the Web</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3cf7fac">1. Introduction</a></li>
<li><a href="#org5c2d997">2. Results</a>
<ul>
<li><a href="#orgf2a53ed">2.1. Selected queries</a>
<ul>
<li><a href="#org6c37765">2.1.1. Q10  Publications&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#orgfcd1d4b">2.1.2. Q11  Journals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org4095629">2.1.3. Q12  Conferences&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#orgcfc22ea">2.1.4. Q13  CoAuthor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org5befa59">2.1.5. Q14  CoAuthor* IRIs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org94b27c2">2.1.6. Q20  CoActor*&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org173d71c">2.1.7. Q22  CoActor* IRIs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org496799c">2.1.8. Q23  CoActor* sameAs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="any">any</span>&#xa0;<span class="yago">yago</span>&#xa0;<span class="dbpedia">dbpedia</span>&#xa0;<span class="lmdb">lmdb</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#org2ed4498">2.1.9. Q24  Movies-IRIs by CoActor*&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span></span></a></li>
<li><a href="#orgc4209b1">2.1.10. Q30  NATO Business&rsquo;&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span>&#xa0;<span class="gubichev">gubichev</span></span></a></li>
<li><a href="#org4ed5bb1">2.1.11. Q32  Airports in Netherlands&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span>&#xa0;<span class="gubichev">gubichev</span></span></a></li>
</ul>
</li>
<li><a href="#org41691bc">2.2. Other queries used</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3cf7fac" class="outline-2">
<h2 id="org3cf7fac"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is better than uninformed search.
</p>
</div>
</div>

<div id="outline-container-org5c2d997" class="outline-2">
<h2 id="org5c2d997"><span class="section-number-2">2</span> Results</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgf2a53ed" class="outline-3">
<h3 id="orgf2a53ed"><span class="section-number-3">2.1</span> Selected queries</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org6c37765" class="outline-4">
<h4 id="org6c37765"><span class="section-number-4">2.1.1</span> Q10  Publications&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-sparql"><span style="color: #4f97d7; font-weight: bold;">prefix</span> dc:         <span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/">&lt;http://purl.org/dc/elements/1.1/&gt;</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/">
</a><span style="color: #4f97d7; font-weight: bold;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/">prefix</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/"> dblpAuthor: </a><span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/">&lt;http://dblp.l3s.de/d2r/resource/authors/&gt;</a></span>

<span style="color: #4f97d7; font-weight: bold;">select</span> * <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">{</span>
  dblpAuthor:Michael_Stonebraker  ^dc:creator/dc:title  <span style="color: #7590db;">?paper</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfcd1d4b" class="outline-4">
<h4 id="orgfcd1d4b"><span class="section-number-4">2.1.2</span> Q11  Journals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dbpedia">dbpedia</span>&#xa0;<span class="selected">selected</span></span></h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-sparql"><span style="color: #4f97d7; font-weight: bold;">prefix</span> dc:         <span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">&lt;http://purl.org/dc/elements/1.1/&gt;</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">
</a><span style="color: #4f97d7; font-weight: bold;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">prefix</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#"> dblpAuthor: </a><span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">&lt;http://dblp.l3s.de/d2r/resource/authors/&gt;</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">
</a><span style="color: #4f97d7; font-weight: bold;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">prefix</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#"> rdfs: </a><span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">&lt;http://www.w3.org/2000/01/rdf-schema#&gt;</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">
</a><span style="color: #4f97d7; font-weight: bold;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">prefix</a></span><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#"> swrc:    </a><span style="color: #a45bad;"><a href="http://purl.org/dc/elements/1.1/&gt;
prefix dblpAuthor: &lt;http://dblp.l3s.de/d2r/resource/authors/&gt;
prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
prefix swrc:    &lt;http://swrc.ontoware.org/ontology#">&lt;http://swrc.ontoware.org/ontology#&gt;</a></span>

<span style="color: #4f97d7; font-weight: bold;">select</span> * <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">{</span>
  dblpAuthor:Michael_Stonebraker  ^dc:creator/swrc:journal/rdfs:label  <span style="color: #7590db;">?paper</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
