index.org
*** Q23  CoActor* sameAs                     :any:yago:dbpedia:lmdb:selected:
This query has no sane, readable SPARQL equivalent, as it has too many optional edges.

From each State, any of these Predicates can be used,
	- ~dbo:starring~
	- ~yago:actedIn~
	- ~frmb:dereif-Performers_and_roles-playsInPerformance~
	- ~owl:sameAs~

And the final state can be reached through any of
	- ~foaf:name~
	- ~rdfs:label~

*** Q24  Movies-IRIs by CoActor*                              :yago:selected:

#+begin_src sparql
prefix yago: <http://yago-knowledge.org/resource/>

select * where {
	yago:Kevin_Bacon
		(yago:actedIn/^yago:actedIn)+/yago:directed
	?movieIRI
}
#+end_src


#+begin_src python
b = QueryBuilder(n, "Actor")
directed = YAGO["directed"]
b.frm("Actor").through(ACTED_IN).to("Movie")
b.frm("Movie").through(ACTED_IN).backwards_to("CoActor", NodeFilter_but(n))

b.frm("CoActor").through(directed).final("Directed_Movie")
#+end_src

*** Q30  NATO Business'                              :yago:selected:gubichev:
 Similar to Gubichev's Q1  (does not ends in ~yago:Berlin~)

 Works on Make-make.  2502 answers in negligible time

#+begin_src python
b = QueryBuilder(YAGO["wikicat_Member_states_of_NATO"])

b.frm("s0").through(RDF["type"]).backwards_to("Area")

b.frm("Area").through(YAGO["dealsWith"]).backwards_to("Place", None, NodeFilter_but(n))

b.frm("Place").through(YAGO["isLocatedIn"]).to("Place")
#+end_src

#+begin_src sparql
PREFIX yago: <http://yago-knowledge.org/resource/>

select * where {
	yago:wikicat_Member_states_of_NATO ^rdf:type/^yago:dealsWith/(yago:isLocatedIn*) ?place
}
#+end_src


*** Q32  Airports in Netherlands                     :yago:selected:gubichev:
 Similar to Gubichev's Q2, but yago:dealsWith was removed

 #+begin_src python
 # Using wikicat_* instead of wikicategory_*

 b = QueryBuilder(n, "EuropeCapitals")
 b.from_("Airports").through( RDF["type"]       ).backwards_to("airport")  # AirportList ~> airport
 b.from_("airport" ).through(YAGO["isLocatedIn"]).final("Place")           # airport     -> Place
 b.from_("Place"   ).through(YAGO["isLocatedIn"]).to("Place")              # Place       -> Place
 #+end_src

 #+begin_src sparql
 PREFIX yago: <http://yago-knowledge.org/resource/>

 select * where {
	 yago:wikicat_Capitals_in_Europe ^rdf:type/yago:isLocatedIn* ?place
 }
 #+end_src



** Other queries used
