index.html


<div id="outline-container-org496799c" class="outline-4">
<h4 id="org496799c"><span class="section-number-4">2.1.8</span> Q23  CoActor* sameAs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="any">any</span>&#xa0;<span class="yago">yago</span>&#xa0;<span class="dbpedia">dbpedia</span>&#xa0;<span class="lmdb">lmdb</span>&#xa0;<span class="selected">selected</span></span></h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
This query has no sane, readable SPARQL equivalent, as it has too many optional edges.
</p>

<p>
From each State, any of these Predicates can be used,
</p>
<ul class="org-ul">
<li><code>dbo:starring</code></li>
<li><code>yago:actedIn</code></li>
<li><code>frmb:dereif-Performers_and_roles-playsInPerformance</code></li>
<li><code>owl:sameAs</code></li>
</ul>

<p>
And the final state can be reached through any of
</p>
<ul class="org-ul">
<li><code>foaf:name</code></li>
<li><code>rdfs:label</code></li>
</ul>
</div>
</div>

<div id="outline-container-org2ed4498" class="outline-4">
<h4 id="org2ed4498"><span class="section-number-4">2.1.9</span> Q24  Movies-IRIs by CoActor*&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span></span></h4>
<div class="outline-text-4" id="text-2-1-9">
<div class="org-src-container">
<pre class="src src-sparql"><span style="color: #4f97d7; font-weight: bold;">prefix</span> yago: <span style="color: #a45bad;"><a href="http://yago-knowledge.org/resource/">&lt;http://yago-knowledge.org/resource/&gt;</a></span>

<span style="color: #4f97d7; font-weight: bold;">select</span> * <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">{</span>
  yago:Kevin_Bacon
    <span style="color: #bc6ec5;">(</span>yago:actedIn/^yago:actedIn<span style="color: #bc6ec5;">)</span>+/yago:directed
  <span style="color: #7590db;">?movieIRI</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">b</span> = QueryBuilder<span style="color: #4f97d7;">(</span>n, <span style="color: #2d9574;">"Actor"</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">directed</span> = YAGO<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"directed"</span><span style="color: #4f97d7;">]</span>
b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Actor"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>ACTED_IN<span style="color: #4f97d7;">)</span>.to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Movie"</span><span style="color: #4f97d7;">)</span>
b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Movie"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>ACTED_IN<span style="color: #4f97d7;">)</span>.backwards_to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"CoActor"</span>, NodeFilter_but<span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"CoActor"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>directed<span style="color: #4f97d7;">)</span>.final<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Directed_Movie"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4209b1" class="outline-4">
<h4 id="orgc4209b1"><span class="section-number-4">2.1.10</span> Q30  NATO Business&rsquo;&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span>&#xa0;<span class="gubichev">gubichev</span></span></h4>
<div class="outline-text-4" id="text-2-1-10">
<p>
Similar to Gubichev&rsquo;s Q1  (does not ends in <code>yago:Berlin</code>)
</p>

<p>
Works on Make-make.  2502 answers in negligible time
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">b</span> = QueryBuilder<span style="color: #4f97d7;">(</span>YAGO<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"wikicat_Member_states_of_NATO"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"s0"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>RDF<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"type"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>.backwards_to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Area"</span><span style="color: #4f97d7;">)</span>

b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Area"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>YAGO<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"dealsWith"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>.backwards_to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span>, <span style="color: #a45bad;">None</span>, NodeFilter_but<span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

b.frm<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>YAGO<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"isLocatedIn"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>.to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sparql"><span style="color: #4f97d7; font-weight: bold;">PREFIX</span> yago: <span style="color: #a45bad;"><a href="http://yago-knowledge.org/resource/">&lt;http://yago-knowledge.org/resource/&gt;</a></span>

<span style="color: #4f97d7; font-weight: bold;">select</span> * <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">{</span>
  yago:wikicat_Member_states_of_NATO ^rdf:type/^yago:dealsWith/<span style="color: #bc6ec5;">(</span>yago:isLocatedIn*<span style="color: #bc6ec5;">)</span> <span style="color: #7590db;">?place</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4ed5bb1" class="outline-4">
<h4 id="org4ed5bb1"><span class="section-number-4">2.1.11</span> Q32  Airports in Netherlands&#xa0;&#xa0;&#xa0;<span class="tag"><span class="yago">yago</span>&#xa0;<span class="selected">selected</span>&#xa0;<span class="gubichev">gubichev</span></span></h4>
<div class="outline-text-4" id="text-2-1-11">
<p>
Similar to Gubichev&rsquo;s Q2, but yago:dealsWith was removed
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Using wikicat_* instead of wikicategory_*</span>

<span style="color: #7590db;">b</span> = QueryBuilder<span style="color: #4f97d7;">(</span>n, <span style="color: #2d9574;">"EuropeCapitals"</span><span style="color: #4f97d7;">)</span>
b.from_<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Airports"</span><span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span> RDF<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"type"</span><span style="color: #bc6ec5;">]</span>       <span style="color: #4f97d7;">)</span>.backwards_to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"airport"</span><span style="color: #4f97d7;">)</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">AirportList ~&gt; airport</span>
b.from_<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"airport"</span> <span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>YAGO<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"isLocatedIn"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>.final<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span><span style="color: #4f97d7;">)</span>           <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">airport     -&gt; Place</span>
b.from_<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span>   <span style="color: #4f97d7;">)</span>.through<span style="color: #4f97d7;">(</span>YAGO<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"isLocatedIn"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>.to<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Place"</span><span style="color: #4f97d7;">)</span>              <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Place       -&gt; Place</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sparql"><span style="color: #4f97d7; font-weight: bold;">PREFIX</span> yago: <span style="color: #a45bad;"><a href="http://yago-knowledge.org/resource/">&lt;http://yago-knowledge.org/resource/&gt;</a></span>

<span style="color: #4f97d7; font-weight: bold;">select</span> * <span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #4f97d7;">{</span>
  yago:wikicat_Capitals_in_Europe ^rdf:type/yago:isLocatedIn* <span style="color: #7590db;">?place</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org41691bc" class="outline-3">
<h3 id="org41691bc"><span class="section-number-3">2.2</span> Other queries used</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2013-06-04 Tue&gt;</span></span></p>
<p class="author">Author: Your name</p>
<p class="date">Created: 2016-12-07 Wed 15:07</p>
<p class="creator">Emacs 24.3.50.3 (Org mode 8.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
